### Simulation des changements d'infrastruture Terraform sur scalingo-recette
#### Format et Style du code Terraform 🖌 : ❌
#### Validation de la configuration de Terraform (`validate`) 🤖 : ✅
<details><summary>Montrer le résultat de la validation</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 : ✅

<details><summary>Montrer les modifications prévues par Terraform</summary>

```

terraform
data.cloudflare_zone.zone: Reading...
data.statuscake_contact_group.default_contact_group: Reading...
module.front_app.data.environment_variables.scalingo_region_env: Reading...
module.front_app.data.environment_variables.scalingo_region_env: Read complete after 0s [id=f2c73497-9268-d5d7-1587-5c1c28760b89]
data.dotenv.envs_du_fichier_env: Reading...
data.dotenv.envs_du_fichier_env: Read complete after 0s [id=��m�@T���W�9���#]
data.cloudflare_zone.zone: Read complete after 1s [id=2df6de52b2ef58de5641d2f2f6b55e78]
data.statuscake_contact_group.default_contact_group: Read complete after 1s [id=286221]
module.front_app.data.scalingo_stack.stack: Reading...
module.front_app.data.scalingo_scm_integration.scm_integration["github"]: Reading...
module.front_app.data.scalingo_stack.stack: Read complete after 1s [id=st-528ed067-917a-4931-875a-40b7500c724a]
module.front_app.scalingo_app.app: Refreshing state... [id=6245cca7623d3a000e9b9517]
module.front_app.data.scalingo_scm_integration.scm_integration["github"]: Read complete after 1s [id=8abb0726-3707-456b-823c-f119d20740aa]
module.front_app.scalingo_scm_repo_link.scm_repo_link["github"]: Refreshing state... [id=6245cca7623d3a000e9b9517]
module.front_app.scalingo_addon.addons["redis"]: Refreshing state... [id=ad-102bc06d-ebc2-4324-a80a-7f030608cec6]
module.front_app.scalingo_domain.canonical_domain["recette.1jeune1solution.gouv.fr"]: Refreshing state... [id=64404508623d3a000f78e375]
cloudflare_record.domaine["recette.1jeune1solution.gouv.fr"]: Refreshing state... [id=6ac534541aae643b4c638fdf2a4d84f6]
statuscake_uptime_check.http_check: Refreshing state... [id=6673787]
module.front_app.scalingo_container_type.containers["web"]: Refreshing state... [id=1j1s-front:web]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.domaine["recette.1jeune1solution.gouv.fr"] will be updated in-place
  ~ resource "cloudflare_record" "domaine" {
      + allow_overwrite = false
        id              = "6ac534541aae643b4c638fdf2a4d84f6"
        name            = "recette"
      ~ tags            = [
          + "app:front",
          + "env:recette",
        ]
        # (10 unchanged attributes hidden)
    }

  # cloudflare_record.domaine_analytics_eulerian["yssn.recette.1jeune1solution.gouv.fr"] will be created
  + resource "cloudflare_record" "domaine_analytics_eulerian" {
      + allow_overwrite = false
      + comment         = "Used for tracking by Eulerian"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "yssn.recette"
      + proxiable       = (known after apply)
      + proxied         = false
      + tags            = [
          + "analytics",
          + "app:front",
          + "env:recette",
          + "eulerian",
        ]
      + ttl             = 1
      + type            = "CNAME"
      + value           = "minsante.ent.et-gv.fr"
      + zone_id         = "2df6de52b2ef58de5641d2f2f6b55e78"
    }

  # statuscake_uptime_check.http_check will be updated in-place
  ~ resource "statuscake_uptime_check" "http_check" {
        id             = "6673787"
        name           = "1j1s-front (recette)"
      ~ tags           = [
          + "app:front",
          + "env:recette",
        ]
        # (6 unchanged attributes hidden)

      ~ http_check {
          ~ validate_ssl     = false -> true
            # (7 unchanged attributes hidden)
        }

      ~ monitored_resource {
          ~ address = "https://recette.1jeune1solution.gouv.fr" -> "https://recette.1jeune1solution.gouv.fr/"
          + host    = "Scalingo (region: osc-fr1)"
        }
    }

  # module.front_app.scalingo_app.app will be updated in-place
  ~ resource "scalingo_app" "app" {
      ~ environment     = {
          + "API_ADRESSE_BASE_URL"                         = (sensitive value)
          + "API_ENGAGEMENT_API_KEY_TOKEN"                 = (sensitive value)
          + "API_ENGAGEMENT_BASE_URL"                      = (sensitive value)
          + "API_ETABLISSEMENTS_PUBLICS"                   = (sensitive value)
          + "API_GEO_BASE_URL"                             = (sensitive value)
          + "API_LA_BONNE_ALTERNANCE_CALLER"               = (sensitive value)
          + "API_LA_BONNE_ALTERNANCE_URL"                  = (sensitive value)
          + "API_LES_ENTREPRISES_SENGAGENT_URL"            = (sensitive value)
          + "API_POLE_EMPLOI_FEATURE"                      = (sensitive value)
          + "API_POLE_EMPLOI_OFFRES_URL"                   = (sensitive value)
          + "API_POLE_EMPLOI_REFERENTIEL_URL"              = (sensitive value)
          + "API_TRAJECTOIRES_PRO_URL"                     = (sensitive value)
          + "BUCKET_S3_URL"                                = (sensitive value)
          + "ENVIRONMENT"                                  = (sensitive value)
          + "IS_REVIEW_APP"                                = (sensitive value)
          + "LOGEMENT_IMAGE_URL_LIST"                      = (sensitive value)
          + "MAILER_SERVICE_ACTIVE"                        = (sensitive value)
          + "MAILER_SERVICE_REDIRECT_TO"                   = (sensitive value)
          + "NEXT_PUBLIC_ALTERNANCE_LBA_FEATURE"           = (sensitive value)
          + "NEXT_PUBLIC_ANALYTICS_DOMAIN"                 = (sensitive value)
          + "NEXT_PUBLIC_ANALYTICS_ENVIRONMENT"            = (sensitive value)
          + "NEXT_PUBLIC_ANALYTICS_EULERIAN_FEATURE"       = (sensitive value)
          + "NEXT_PUBLIC_ANALYTICS_SCRIPT_HASH"            = (sensitive value)
          + "NEXT_PUBLIC_API_ADRESSE_MINIMUM_QUERY_LENGTH" = (sensitive value)
          + "NEXT_PUBLIC_CAMPAGNE_APPRENTISSAGE_FEATURE"   = (sensitive value)
          + "NEXT_PUBLIC_DEPOT_STAGE_FEATURE"              = (sensitive value)
          + "NEXT_PUBLIC_FAQ_FEATURE"                      = (sensitive value)
          + "NEXT_PUBLIC_FORMATION_LBA_FEATURE"            = (sensitive value)
          + "NEXT_PUBLIC_INDEX_ANNONCE_DE_LOGEMENT"        = (sensitive value)
          + "NEXT_PUBLIC_INDEX_OFFRE_DE_STAGE"             = (sensitive value)
          + "NEXT_PUBLIC_JOB_ETE_FEATURE"                  = (sensitive value)
          + "NEXT_PUBLIC_LA_BONNE_ALTERNANCE_URL"          = (sensitive value)
          + "NEXT_PUBLIC_LOGEMENT_FEATURE"                 = (sensitive value)
          + "NEXT_PUBLIC_RECHERCHE_EVENEMENT_FEATURE"      = (sensitive value)
          + "NEXT_PUBLIC_SENTRY_DSN"                       = (sensitive value)
          + "NEXT_PUBLIC_SENTRY_ENVIRONMENT"               = (sensitive value)
          + "NEXT_PUBLIC_SENTRY_LOG_LEVEL"                 = (sensitive value)
          + "NEXT_PUBLIC_SENTRY_TRACES_SAMPLE_RATE"        = (sensitive value)
          + "NEXT_PUBLIC_SENTRY_USER_AGENT_BLACKLIST"      = (sensitive value)
          + "NEXT_PUBLIC_STAGE_SEARCH_ENGINE_API_KEY"      = (sensitive value)
          + "NEXT_PUBLIC_STAGE_SEARCH_ENGINE_BASE_URL"     = (sensitive value)
          + "NEXT_TELEMETRY_DISABLED"                      = (sensitive value)
          + "NODE_MODULES_CACHE"                           = (sensitive value)
          + "POLE_EMPLOI_CONNECT_CLIENT_ID"                = (sensitive value)
          + "POLE_EMPLOI_CONNECT_CLIENT_SECRET"            = (sensitive value)
          + "POLE_EMPLOI_CONNECT_SCOPE"                    = (sensitive value)
          + "POLE_EMPLOI_CONNECT_URL"                      = (sensitive value)
          + "SENTRY_AUTH_TOKEN"                            = (sensitive value)
          + "SENTRY_DSN"                                   = (sensitive value)
          + "SENTRY_ENVIRONMENT"                           = (sensitive value)
          + "SENTRY_ORG"                                   = (sensitive value)
          + "SENTRY_PROJECT"                               = (sensitive value)
          + "SENTRY_TRACES_SAMPLE_RATE"                    = (sensitive value)
          + "SENTRY_URL"                                   = (sensitive value)
          + "SENTRY_USER_AGENT_BLACKLIST"                  = (sensitive value)
          + "STRAPI_AUTH"                                  = (sensitive value)
          + "STRAPI_BASE_URL"                              = (sensitive value)
          + "STRAPI_MEDIA_URL"                             = (sensitive value)
          + "STRAPI_URL_API"                               = (sensitive value)
          + "TIPIMAIL_API_BASE_URL"                        = (sensitive value)
          + "TIPIMAIL_API_KEY"                             = (sensitive value)
          + "TIPIMAIL_API_USER"                            = (sensitive value)
        }
        id              = "6245cca7623d3a000e9b9517"
        name            = "1j1s-front"
        # (5 unchanged attributes hidden)
    }

  # module.front_app.scalingo_domain.canonical_domain["recette.1jeune1solution.gouv.fr"] will be updated in-place
  ~ resource "scalingo_domain" "canonical_domain" {
      ~ canonical   = false -> true
        id          = "64404508623d3a000f78e375"
        # (2 unchanged attributes hidden)
    }

  # module.front_app.scalingo_log_drain.log_drain["elk"] will be created
  + resource "scalingo_log_drain" "log_drain" {
      + app       = "1j1s-front"
      + drain_url = (sensitive value)
      + id        = (known after apply)
      + type      = "elk"
      + url       = (sensitive value)
    }

  # module.front_app.scalingo_scm_repo_link.scm_repo_link["github"] must be replaced
-/+ resource "scalingo_scm_repo_link" "scm_repo_link" {
      ~ app                          = "6245cca7623d3a000e9b9517" -> "1j1s-front" # forces replacement
      ~ id                           = "6245cca7623d3a000e9b9517" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Pour appliquer les changements proposés par ce plan :
- en recette : il suffit de merger cette PR
- en production : il faut merger la PR de release (créée par release-please)

*Environnement: `scalingo-recette`, Auteur: @juliebrunetto83, Répertoire: `./terraform`*